In [4]:
# Merge e GroupBy // By Jehann Câmara
import pandas as pd

In [5]:
# Cadastro da loja A
cadastro_a = {  
                "Id":    ["AA2648","BB2233", "CC1675", "DD2497","EE2198"],
                "Nome":  ["Aya", "Cesar", "Bruna", "Maria", "Cristina"],
                "Idade": [1,28,27,35,45],
                "CEP":   ["60125-050", "60125-040","60125-030", "60125-020", "60125-010"]
             }

cadastro_a = pd.DataFrame(cadastro_a, columns = ["Id","Nome","Idade","CEP"]) 
cadastro_a

       Id      Nome  Idade        CEP
0  AA2648       Aya      1  60125-050
1  BB2233     Cesar     28  60125-040
2  CC1675     Bruna     27  60125-030
3  DD2497     Maria     35  60125-020
4  EE2198  Cristina     45  60125-010

In [6]:
# Cadastro da loja B
cadastro_b = {  
                "Id":    ["AA3448","BB2233", "CC1675", "DD2347","EE2578"],
                "Nome":  ["Bruno", "Cesar", "Cristiano", "Ronaldo", "Julio"],
                "Idade": [19,28,37,45,60],
                "CEP":   ["60135-050", "60135-040","60135-030", "6015-020", "60125-010"]
             }

cadastro_b = pd.DataFrame(cadastro_b, columns = ["Id","Nome","Idade","CEP"]) 
cadastro_b

       Id       Nome  Idade        CEP
0  AA3448      Bruno     19  60135-050
1  BB2233      Cesar     28  60135-040
2  CC1675  Cristiano     37  60135-030
3  DD2347    Ronaldo     45   6015-020
4  EE2578      Julio     60  60125-010

In [7]:
# Registro de compras em todas as Lojas
compras = {  
                "Id":    ["CC1675","BB2233", "BB2233", "DD2347","AA2648", "BB2353", "CC3875", "EE2198"],
                "Data":  ["2025-01-01", "2024-01-01", "2023-01-01", "2022-01-01", "2021-01-01", "2026-01-01", "2019-01-01", "2018-01-01"],
                "Valor": [200,247,50,30,150,100, 45,60]
             }

compras = pd.DataFrame(compras, columns = ["Id","Data","Valor"]) 
compras

       Id        Data  Valor
0  CC1675  2025-01-01    200
1  BB2233  2024-01-01    247
2  BB2233  2023-01-01     50
3  DD2347  2022-01-01     30
4  AA2648  2021-01-01    150
5  BB2353  2026-01-01    100
6  CC3875  2019-01-01     45
7  EE2198  2018-01-01     60

In [8]:
# Merge
#pd.merge(tabela_esquerda, tabela_direita, on="coluna coincidente", how"left|rigth|inner|outer)

pd.merge(cadastro_a, cadastro_b, on="Id", how="inner")

       Id Nome_x  Idade_x      CEP_x     Nome_y  Idade_y      CEP_y
0  BB2233  Cesar       28  60125-040      Cesar       28  60135-040
1  CC1675  Bruna       27  60125-030  Cristiano       37  60135-030

In [9]:
# Filto por tabela B/y - ["Id", "Idade", "CEP"]
pd.merge(cadastro_a, cadastro_b[["Id", "Idade", "CEP"]], on="Id", how="left")

       Id      Nome  Idade_x      CEP_x  Idade_y      CEP_y
0  AA2648       Aya        1  60125-050      NaN        NaN
1  BB2233     Cesar       28  60125-040     28.0  60135-040
2  CC1675     Bruna       27  60125-030     37.0  60135-030
3  DD2497     Maria       35  60125-020      NaN        NaN
4  EE2198  Cristina       45  60125-010      NaN        NaN

In [10]:
# Filto por tabela y - ["Id", "Idade", "CEP"]
pd.merge(cadastro_a, cadastro_b[["Id", "Idade", "CEP"]], on="Id", how="left" , suffixes=("_A","_B"))

       Id      Nome  Idade_A      CEP_A  Idade_B      CEP_B
0  AA2648       Aya        1  60125-050      NaN        NaN
1  BB2233     Cesar       28  60125-040     28.0  60135-040
2  CC1675     Bruna       27  60125-030     37.0  60135-030
3  DD2497     Maria       35  60125-020      NaN        NaN
4  EE2198  Cristina       45  60125-010      NaN        NaN

In [11]:
#Full Join ( contém duplicados)
lojas = pd.concat([cadastro_a,cadastro_b], ignore_index=True)
lojas

       Id       Nome  Idade        CEP
0  AA2648        Aya      1  60125-050
1  BB2233      Cesar     28  60125-040
2  CC1675      Bruna     27  60125-030
3  DD2497      Maria     35  60125-020
4  EE2198   Cristina     45  60125-010
5  AA3448      Bruno     19  60135-050
6  BB2233      Cesar     28  60135-040
7  CC1675  Cristiano     37  60135-030
8  DD2347    Ronaldo     45   6015-020
9  EE2578      Julio     60  60125-010

In [12]:
# Remover duplicados/ clientes únicos
lojas.drop_duplicates(subset="Id")

       Id      Nome  Idade        CEP
0  AA2648       Aya      1  60125-050
1  BB2233     Cesar     28  60125-040
2  CC1675     Bruna     27  60125-030
3  DD2497     Maria     35  60125-020
4  EE2198  Cristina     45  60125-010
5  AA3448     Bruno     19  60135-050
8  DD2347   Ronaldo     45   6015-020
9  EE2578     Julio     60  60125-010

In [13]:
#Left Join
pd.merge(cadastro_a, compras, on="Id", how="left")

       Id      Nome  Idade        CEP        Data  Valor
0  AA2648       Aya      1  60125-050  2021-01-01  150.0
1  BB2233     Cesar     28  60125-040  2024-01-01  247.0
2  BB2233     Cesar     28  60125-040  2023-01-01   50.0
3  CC1675     Bruna     27  60125-030  2025-01-01  200.0
4  DD2497     Maria     35  60125-020         NaN    NaN
5  EE2198  Cristina     45  60125-010  2018-01-01   60.0

In [14]:
esquerda = pd.merge(cadastro_a, compras, on="Id", how="left")

In [15]:
#esquerda.groupby(['Id','Nome'])['valor'].sum()

In [16]:
# Outer
pd.merge(cadastro_a, cadastro_b, on="Id", how="outer", indicator=True)

,Id,Nome_x,Idade_x,CEP_x,Nome_y,Idade_y,CEP_y,_merge
0,AA2648,Aya,1.0,60125-050,NaN,NaN,NaN,left_only
1,AA3448,NaN,NaN,NaN,Bruno,19.0,60135-050,right_only
2,BB2233,Cesar,28.0,60125-040,Cesar,28.0,60135-040,both
3,CC1675,Bruna,27.0,60125-030,Cristiano,37.0,60135-030,both
4,DD2347,NaN,NaN,NaN,Ronaldo,45.0,6015-020,right_only
5,DD2497,Maria,35.0,60125-020,NaN,NaN,NaN,left_only
6,EE2198,Cristina,45.0,60125-010,NaN,NaN,NaN,left_only
7,EE2578,NaN,NaN,NaN,Julio,60.0,60125-010,right_only

In [3]:
# GroupBY
import numpy as np
import pandas as pd

df4 = pd.DataFrame({  
                "A": ["verdadeiro","falso","verdadeiro","falso","verdadeiro","falso","verdadeiro","falso"],
                "B": ["um","dois","um","tres","tres","um","tres","dois"],
                "C": np.random.randn(8),
                "D": np.random.randn(8)
             })

df4

            A     B         C         D
0  verdadeiro    um  1.135930  1.530235
1       falso  dois -1.152187  1.202722
2  verdadeiro    um -0.210601 -0.099358
3       falso  tres -0.313169  0.984976
4  verdadeiro  tres  0.512848  1.702577
5       falso    um  0.114057 -0.616297
6  verdadeiro  tres -0.540915  1.168167
7       falso  dois  1.551228 -1.047659

In [14]:
df4.groupby(["A"]).sum() # Agrupamento com soma

                         B         C         D
A
falso       doistresumdois  0.199928  0.523742
verdadeiro    umumtrestres  0.897262  4.301621

In [15]:
df4.groupby(["B"]).sum() # Agrupamento com soma

                              A         C         D
B
dois                 falsofalso  0.399040  0.155063
tres  falsoverdadeiroverdadeiro -0.341236  3.855720
um    verdadeiroverdadeirofalso  1.039386  0.814580

In [16]:
df4.groupby(["A", "B"]).sum() # Agrupamento com soma agrupando por A e B

                        C         D
A          B
falso      dois  0.399040  0.155063
           tres -0.313169  0.984976
           um    0.114057 -0.616297
verdadeiro tres -0.028067  2.870744
           um    0.925329  1.430877